it-service/ssl/Catalogs/Должности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Должности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущаяЗаработнаяПлата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Описание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаличиеОпыта</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеОбразования</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереченьНавыков</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаработнаяПлата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

it-service/ssl/Catalogs/Должности/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	 // Проверяем, есть ли строки в табличной части "Описание"
    Если Объект.Описание.Количество() > 0 Тогда
        // Получаем последнюю строку табличной части
        ПоследняяСтрока = Объект.Описание[Объект.Описание.Количество() - 1];
        
        // Присваиваем значение реквизита "ЗаработнаяПлата" текущему объекту
        Объект.ТекущаяЗаработнаяПлата = ПоследняяСтрока.ЗаработнаяПлата;
    КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)      
	
	// Проверяем, есть ли строки в табличной части "Описание"
    Если Объект.Описание.Количество() > 0 Тогда
        // Получаем последнюю строку табличной части
        ПоследняяСтрока = Объект.Описание[Объект.Описание.Количество() - 1];
        
        // Присваиваем значение реквизита "ЗаработнаяПлата" текущему объекту
        Объект.ТекущаяЗаработнаяПлата = ПоследняяСтрока.ЗаработнаяПлата;
	КонецЕсли;    
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеЗаработнаяПлатаПриИзменении(Элемент)
	
	// Проверяем, есть ли строки в табличной части "Описание"
    Если Объект.Описание.Количество() > 0 Тогда
        // Получаем последнюю строку табличной части
        ПоследняяСтрока = Объект.Описание[Объект.Описание.Количество() - 1];
        
        // Присваиваем значение реквизита "ЗаработнаяПлата" текущему объекту
        Объект.ТекущаяЗаработнаяПлата = ПоследняяСтрока.ЗаработнаяПлата;
	КонецЕсли;
	
КонецПроцедуры
